{
  "irrelevant": [
    {
      "student_id": "310350",
      "userStory": "As a student, I want to see how long a study room is available so that I can choose one and study accordingly.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is irrelevant as it falls outside the scope of the ToDo app's features.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "310350",
      "userStory": "As a user, I want to filter products in a price range, so that I can find one within my budget.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is irrelevant as it pertains to product filtering, which is outside the scope of a ToDo app.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "344697",
      "userStory": "As an admin, I want to view a summary of users who logged in with Google, including their email and location, with the option to filter by region and export the summary as a CSV, so that I can analyze where the app is being used.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is irrelevant as it falls outside the scope of the ToDo app's core features.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "356523",
      "userStory": "As a customer, I want to be able to have automatic monthly billing for the app so that the payment process is as easy as possible.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is irrelevant as it falls outside the scope of the ToDo app's core functionalities.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "357248",
      "userStory": "As an online shop customer, I want to be able to see reviews of products so that I can be sure of the quality of the product before I buy it.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story is irrelevant as it pertains to product reviews, which is outside the scope of a ToDo app.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "357248",
      "userStory": "As a streaming service user, I want to generate a monthly report of the movie genres I watched so that I can see what I watched the most.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story is irrelevant as it pertains to a streaming service, which is outside the scope of a ToDo app.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "361582",
      "userStory": "As an online shopper, I want to save my favorite products to a wishlist so that I can easily access them later and make a purchase decision when I'm ready.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is irrelevant as it pertains to an online shopping feature, which is outside the scope of a ToDo app.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "361984",
      "userStory": "As a Microsoft Outlook user, I want to have a tab with all my current subscriptions so that I can more easily unsubscribe from the newsletters that are polluting my inbox.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is irrelevant as it pertains to managing email subscriptions, which is outside the scope of a ToDo app.",
      "tags": [
        "irrelevant"
      ]
    },
    {
      "student_id": "361984",
      "userStory": "As a Youtube user, I want to be able to disable Youtube shorts for my account, so that I don't loose time scrolling on cats shorts.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is irrelevant as it pertains to YouTube, not the ToDo app's features like task management or mapping.",
      "tags": [
        "irrelevant"
      ]
    }
  ],
  "ui-polish": [
    {
      "student_id": "315594",
      "userStory": "As a user, I want to see a motivating message when I complete a task, so that it motivates me to complete the remaining tasks",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "325520",
      "userStory": "As a user, I want to personalize my ToDos with emotes, so I can easily find them and know what activity they correspond to.",
      "grade": 3,
      "feedback": "Grade 3/5. The idea of personalizing ToDos with emotes is cosmetic and not essential for the core functionality of the app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "339394",
      "userStory": "As a user, I want to see the percentage of my tasks completed on a colorful progress diagram displayed on my screen, and be rewarded with a sparkling animation of confetti whenever I complete a task, so that I can both track my progress and feel motivated.",
      "grade": 1,
      "feedback": "Grade 1/5. The request for a colorful progress diagram and confetti animation is oversized, combining multiple features that distract from core task management functionalities.",
      "tags": [
        "oversized",
        "ui-polish"
      ]
    },
    {
      "student_id": "342289",
      "userStory": "As a new user, I want to have an intuitive interface so that I don't lose time in a tutorial.",
      "grade": 3,
      "feedback": "Grade 3/5. The request for an intuitive interface is too vague; please specify which aspects of the UI need improvement to enhance user experience.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "342757",
      "userStory": "As a user, I want to color the tasks so that I can categorize my tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "347572",
      "userStory": "As an older user, I want to be able to calibrate the font size to be able to read the content the application is showing me better.",
      "grade": 3,
      "feedback": "Grade 3/5. This request is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "355522",
      "userStory": "As a new user, I want to be shown a tour of the app's features, so that I can quickly start using the app properly.",
      "grade": 3,
      "feedback": "Grade 3/5. This story is more cosmetic than essential; consider focusing on core functionalities like task creation and management instead.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "355627",
      "userStory": "As a user, I want a phone widget so that I can see my tasks directly on my home screen when I open my phone.",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is cosmetic and not essential to the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "355741",
      "userStory": "As a user, I want to be able to assign a music playlist to each to-do list, so that I can listen to it while completing the tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is cosmetic and not essential to the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "355929",
      "userStory": "As a user, I want to have a home screen widget showing my tasks, so that I can access my tasks without opening the app.",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "356574",
      "userStory": "As an old user (67 years old), I want to be able to increase the letter size so that I can read it despite my poor eyesight.",
      "grade": 3,
      "feedback": "Grade 3/5. This request is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "357403",
      "userStory": "User Story: As a user, I want a satisfying visual or sound effect to play every time I finish a task, So that I can feel a sense of accomplishment and stay motivated to complete more tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This request is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "361384",
      "userStory": "As a user, I want to visualize my to-do lists in augmented reality around my workspace, so that I can see my tasks in my environment without looking at my phone.",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is outside the app’s scope, as it focuses on augmented reality rather than essential task management functionalities.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "361582",
      "userStory": "As a new user, I want to receive a welcome tutorial upon first login so that I can quickly understand how to navigate the platform and use its key features.",
      "grade": 3,
      "feedback": "Grade 3/5. This welcome tutorial is a cosmetic enhancement; focus on core functionalities like task management instead.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "361990",
      "userStory": "As a user, I want to visualize my ToDos as a progress map, so that I am motivated to complete more of them.",
      "grade": 3,
      "feedback": "Grade 3/5. The idea of a progress map is cosmetic and not essential to the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "362239",
      "userStory": "As a busy person, I want to color-code my tasks so I can categorize tasks on my to-do list",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is cosmetic and not essential; focus on core functionalities like task creation and management first.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "362262",
      "userStory": "As a user, I want to assign different colors to categories of tasks, so that I can quickly identify and organize them visually.",
      "grade": 3,
      "feedback": "Grade 3/5. This feature is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    },
    {
      "student_id": "363568",
      "userStory": "As a user, I want to be able to add an icon to the task so that I can easily recognize the task.",
      "grade": 3,
      "feedback": "Grade 3/5. This request is cosmetic and not essential for the core functionality of the ToDo app.",
      "tags": [
        "ui-polish"
      ]
    }
  ],
  "untagged": [
    {
      "student_id": "315594",
      "userStory": "As a user, I want to be able to launch a timer whenever I'm working on a task, so that I can track the total time spent on each task and better manage my time",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the scope of the ToDo app, enhancing task management effectively.",
      "tags": []
    },
    {
      "student_id": "315696",
      "userStory": "As a user, I want to set reminders for my ToDos so that I receive notifications when a task is due.",
      "grade": 5,
      "feedback": "Grade 5/5. Great addition! Setting reminders enhances task management and aligns perfectly with the app's purpose of helping users stay organized.",
      "tags": []
    },
    {
      "student_id": "315696",
      "userStory": "As a user, I want to set recurring ToDos (e.g., daily, weekly, monthly) so that I can automatically keep track of repetitive tasks without creating them manually each time.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature is clear, relevant, and enhances task management in the app, allowing users to automate repetitive tasks effectively.",
      "tags": []
    },
    {
      "student_id": "316029",
      "userStory": "As a busy student, I want the app to categorize my tasks by urgency and importance so that I can focus on the most urgent tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by prioritizing urgency and importance, which is essential for a ToDo app.",
      "tags": []
    },
    {
      "student_id": "316029",
      "userStory": "As an unorganized student, I want the app to automatically transfer due dates to my calendar so that I can see them on my lock screen.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature is clear and relevant, enhancing task management by integrating with calendars, which is a valuable addition for students.",
      "tags": []
    },
    {
      "student_id": "325520",
      "userStory": "As a sociable user, I want to access my friends' ToDo list, so that I can join them in some of their activities.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear and relevant, but accessing friends' ToDo lists is outside the app’s current scope.",
      "tags": []
    },
    {
      "student_id": "327057",
      "userStory": "As a user, I want to be able to order my to-do list by priority so that I can see what tasks are most important.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the app's scope, enhancing task management by prioritization.",
      "tags": []
    },
    {
      "student_id": "327530",
      "userStory": "As a user, I want to be able to set priority levels for my ToDos, so that I triage which to actually do when short on time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the scope of the ToDo app, enhancing task management effectively.",
      "tags": []
    },
    {
      "student_id": "328216",
      "userStory": "As a user, I would like to create multiple task lists such that I can organize my tasks by different projects or categories.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's goal of task organization.",
      "tags": []
    },
    {
      "student_id": "328216",
      "userStory": "As a user, I want to set reminders for my tasks such that I can ensure I never forget important deadlines.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the core functionality of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "328216",
      "userStory": "As a user, I want to track my completed tasks so that I can measure my productivity.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, aligning well with the app's goal of task management and productivity tracking.",
      "tags": []
    },
    {
      "student_id": "328216",
      "userStory": "As a user, I want to collaborate with my friends on tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. Great idea! Collaborating on tasks enhances user engagement and aligns well with the app's purpose.",
      "tags": []
    },
    {
      "student_id": "328225",
      "userStory": "As a user, I want to assign priority levels (e.g., high, medium, low) to my tasks so that I can focus on the most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature enhances task management by allowing users to prioritize effectively, aligning perfectly with the app's purpose. Great job!",
      "tags": []
    },
    {
      "student_id": "328225",
      "userStory": "As a user, I want to filter my tasks by completed, pending, or overdue status so that I can quickly see what I still need to do.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the core functionality of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "328412",
      "userStory": "As a busy person, I want to be reminded to do certain tasks, so that I don't forget them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, emphasizing the importance of reminders in managing tasks effectively within the app.",
      "tags": []
    },
    {
      "student_id": "328412",
      "userStory": "As an organised person, I want to add categories to my tasks, so that I can sort them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task organization within the app's scope. Great job!",
      "tags": []
    },
    {
      "student_id": "330258",
      "userStory": "As a user, I want to track my progress in completing ToDos within their specified due dates, so that I can identify areas where I need to improve my time management and productivity.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! Your focus on tracking progress aligns well with the app's goal of enhancing time management and productivity.",
      "tags": []
    },
    {
      "student_id": "332446",
      "userStory": "As a user of the ToDoApp, I want to be able to get notifications on my phone when the deadline of the task is close so that I do not forget it.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the ToDo app's functionality.",
      "tags": []
    },
    {
      "student_id": "339364",
      "userStory": "As a user I want to receive 2 daily notifications to remind me of the tasks that need to be done.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; daily notifications enhance task management and user engagement in the ToDo app.",
      "tags": []
    },
    {
      "student_id": "339394",
      "userStory": "As a user, I want to receive notifications as reminders when I am close to a deadline so that I can complete my task on time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the ToDo app's functionality, enhancing user experience with timely reminders.",
      "tags": []
    },
    {
      "student_id": "339511",
      "userStory": "As a forgetful user, I want to receive daily reminders for overdue tasks so that I can stay on top of my to-do list and not miss any important deadlines.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and aligns perfectly with the app's purpose of helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "339607",
      "userStory": "As a user, I want to be able to add certain To-Dos to my public profile, so that I can share my tasks with my friends",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the app's scope, enhancing social sharing of tasks.",
      "tags": []
    },
    {
      "student_id": "339718",
      "userStory": "As a user, I want to add tags to my to-do's so that I can better search and filter my to-do's.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and well within the scope of the ToDo app, enhancing task organization and searchability.",
      "tags": []
    },
    {
      "student_id": "339718",
      "userStory": "As a user, I want to be able to have multi-stage to-do's so I can add more complex and layered tasks to the app.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by allowing for more complex task management.",
      "tags": []
    },
    {
      "student_id": "339815",
      "userStory": "As a user, I want to group my tasks into categories, so that I can organize my tasks purposefully.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task organization within the app's scope. Great job!",
      "tags": []
    },
    {
      "student_id": "339815",
      "userStory": "As a user, I want to receive a notification when a task is due, so that I can complete it on time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's functionality, enhancing task management for users.",
      "tags": []
    },
    {
      "student_id": "339839",
      "userStory": "As a user, I want to set reminders for my tasks so that I don’t miss important deadlines and stay organized",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management in the app by helping users stay organized with reminders.",
      "tags": []
    },
    {
      "student_id": "339839",
      "userStory": "As a user, I want to be able to attach files or images to my tasks so that I can reference important documents or visuals directly within the app.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of enhancing task management. Great job!",
      "tags": []
    },
    {
      "student_id": "340059",
      "userStory": "As a user, I want to mark the priority tasks, so that I can check the important tasks easily.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; marking priority tasks will enhance task management in the app, making it easier for users to focus on important items.",
      "tags": []
    },
    {
      "student_id": "340060",
      "userStory": "As a user, I want to be able to set priority for each to-do so that I can decide which one to do first.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "340946",
      "userStory": "As a user, I want to do lists to be collaborative, so that I can share goals with my team and colleagues.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear and relevant, but it introduces a collaborative feature that is outside the current scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "341201",
      "userStory": "As a user, I want to set recurring to-dos, so that I can automate repetitive tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by addressing a common user need for managing repetitive tasks.",
      "tags": []
    },
    {
      "student_id": "341201",
      "userStory": "As a user, I want to assign a priority level to my to-dos, so that I can focus on the most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize effectively within the ToDo app.",
      "tags": []
    },
    {
      "student_id": "341205",
      "userStory": "As a user, I want to be able to share my to-dos with others so that I can delegate tasks to others.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management and collaboration.",
      "tags": []
    },
    {
      "student_id": "341205",
      "userStory": "As a user, I want to be able to receive notifications about my to-dos so that I can be reminded to complete them.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and aligns well with the ToDo app's functionality.",
      "tags": []
    },
    {
      "student_id": "341467",
      "userStory": "As a user, I want to be able to lock some ToDos with my phone's authentication method, so that only I can see them.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature enhances security for sensitive tasks, aligning perfectly with the app's purpose of managing ToDos effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "341467",
      "userStory": "As a user, I want to be able to share a ToDO with another registered user of the app, so that we can collaborate on it.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing collaboration within the ToDo app effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "341660",
      "userStory": "As a user, I want to set reminders for my to-dos so that I am notified when a task is approaching its due date.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "341660",
      "userStory": "As a user, I want to organize my to-dos by categories so that I can easily manage and filter my tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management within the app by allowing users to categorize their to-dos effectively.",
      "tags": []
    },
    {
      "student_id": "341957",
      "userStory": "As a user, I want to share my to-dos with my friends so that they can have the same tasks as I do.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management. Great job!",
      "tags": []
    },
    {
      "student_id": "341957",
      "userStory": "As a user, I want to receive reminder notifications about my to-dos so that I don’t forget them even when I don’t open the app.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "341981",
      "userStory": "As a user, I want to organize my ToDos by priority so that I can see the most important ones first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task organization. Great job!",
      "tags": []
    },
    {
      "student_id": "341981",
      "userStory": "As a user, I want to create different lists of ToDos so that I can distinguish between work and personal tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by allowing users to organize tasks effectively.",
      "tags": []
    },
    {
      "student_id": "341989",
      "userStory": "As a user, I want to set priority levels for my tasks, so that I can focus on completing the most important ones first.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns well with the core functionality of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "341989",
      "userStory": "As a user, I want to receive encouraging notifications when I complete tasks, so I feel motivated to keep using the app.",
      "grade": 5,
      "feedback": "Grade 5/5. Great idea! Encouraging notifications can enhance user engagement and motivation, aligning perfectly with the app's purpose of task management.",
      "tags": []
    },
    {
      "student_id": "342062",
      "userStory": "As a user, I want to be able to share certain TODO tasks so that I can coordinate tasks with multiple people at the same time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing collaboration within the ToDo app's task management features. Great job!",
      "tags": []
    },
    {
      "student_id": "342062",
      "userStory": "As a user, I want to be able to assign level of importance on my tasks so that I can better prioritize my time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "342605",
      "userStory": "As a user, I want to be able to share my ToDos with other peers so that I can collaborate with them on the same project.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the collaborative features that enhance the ToDo app experience.",
      "tags": []
    },
    {
      "student_id": "342896",
      "userStory": "As a user, I want to receive reminder notifications for my ToDos, so that I can be alerted about upcoming tasks without needing to open the app.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "342896",
      "userStory": "As a user, I want to share my ToDos with others, so that I can collaborate on tasks or delegate them efficiently.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; sharing ToDos enhances collaboration, fitting perfectly within the app's scope for task management.",
      "tags": []
    },
    {
      "student_id": "344200",
      "userStory": "As a user, I want to share my ToDos with other users, so that we can collaborate on tasks or projects.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the collaborative features that enhance the ToDo app experience.",
      "tags": []
    },
    {
      "student_id": "344314",
      "userStory": "As a user, I want to receive notifications reminding me of my unfinished to-dos for the day, so that I don't forget to complete them on time.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the core functionality of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "344316",
      "userStory": "As a user, I want to set reminders for my to-dos, so that I get notified about tasks before they are due.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "344316",
      "userStory": "As a user, I want to organize my to-dos using categories or tags, so that I can easily group and filter tasks based on their type or priority.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's goal of enhancing task organization.",
      "tags": []
    },
    {
      "student_id": "345101",
      "userStory": "As a user, I want to get notified one day before my to-dos' due dates, so that I don't forget about them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app by helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "345101",
      "userStory": "As a user, I want my achieved to-dos to be put in a separate list, so that I keep up with what has and still hasn't been done.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by separating achieved to-dos, which is a valuable feature for the app.",
      "tags": []
    },
    {
      "student_id": "345164",
      "userStory": "As a user, I want to prioritize my to-dos, so that I can work on my most important or urgent ones, making it easier to concentrate on the essentials.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing prioritization, which is essential for effective use of the app.",
      "tags": []
    },
    {
      "student_id": "345164",
      "userStory": "As a user, I want to receive notifications on short deadlines, so that I can stay on track with my schedule.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "345232",
      "userStory": "as a absent-minded person, I want reminder notifications for the tasks which the due date is coming soon so that I don't forget to do them",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, effectively addressing the need for reminder notifications in the ToDo app.",
      "tags": []
    },
    {
      "student_id": "345291",
      "userStory": "As a user, I want to share my ToDos with my friends, so that we can work on a common project.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management and collaboration.",
      "tags": []
    },
    {
      "student_id": "345291",
      "userStory": "As a user, I want a history of my ToDos, so that I can keep track of my productivity.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by allowing users to track their productivity effectively.",
      "tags": []
    },
    {
      "student_id": "345375",
      "userStory": "As a power user, I want to be able to create multiple lists of ToDos so that I can sort and organise my tasks by type.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; organizing tasks into multiple lists enhances user experience and aligns perfectly with the app's purpose.",
      "tags": []
    },
    {
      "student_id": "345472",
      "userStory": "As a user, I want to organise my ToDos by topics, so that I can easily organise and filter them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task organization within the app effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "345472",
      "userStory": "As a user, I want to be able to share my ToDos with other users, so that I can collaborate on them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the scope of the ToDo app, promoting collaboration effectively.",
      "tags": []
    },
    {
      "student_id": "345556",
      "userStory": "As a user, I want to rate my to-dos on a scale from 1 to 5, so that I can prioritize and choose the order in which to complete them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task prioritization in the ToDo app effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "345769",
      "userStory": "As a user, I want to sort the ToDos by their due date, so that I can prioritise tasks that are approaching their deadline and stay organised.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by prioritizing due dates effectively within the ToDo app.",
      "tags": []
    },
    {
      "student_id": "346017",
      "userStory": "As a user, I want to share a ToDo with other users, so that we can collaborate on tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; sharing tasks for collaboration enhances the app's functionality and user experience.",
      "tags": []
    },
    {
      "student_id": "346017",
      "userStory": "As a user, I want to archive completed ToDos, so that I can keep my list of tasks clean and organized.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's goal of task management.",
      "tags": []
    },
    {
      "student_id": "346469",
      "userStory": "As a user with a busy schedule, I want to categorize my ToDos by priority so that I can better focus on urgent and important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management. Great job!",
      "tags": []
    },
    {
      "student_id": "346469",
      "userStory": "As an absent-minded person, I want to receive a reminder for my Todos when they are due, so that I don't miss any important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app by adding a valuable reminder feature for due tasks.",
      "tags": []
    },
    {
      "student_id": "346481",
      "userStory": "As a user, I want to be able to archive a ToDo, so that I can keep a ToDo for later without this ToDo distracting me from the other ToDo.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to archive ToDos without distraction.",
      "tags": []
    },
    {
      "student_id": "346481",
      "userStory": "As a user, I want to be able to reorder the ToDos, so that I can order my ToDos depending on their priority to improve my organization.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and enhances task organization within the ToDo app.",
      "tags": []
    },
    {
      "student_id": "346511",
      "userStory": "As a user, I want to have a calendar view for my tasks, so that I can easily plan and see what I have to do on a specific day.",
      "grade": 5,
      "feedback": "Grade 5/5. Great idea! A calendar view would enhance task management and planning, fitting perfectly within the app's scope.",
      "tags": []
    },
    {
      "student_id": "346511",
      "userStory": "As a user, I want to organize my tasks with labels, so that I can easily find all tasks related to a specific topic.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "346571",
      "userStory": "As a user, I want to sort my ToDos by due date, so that I can prioritize the most urgent tasks on my list.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and aligns perfectly with the app's functionality for task management.",
      "tags": []
    },
    {
      "student_id": "346586",
      "userStory": "As a user, I want to set different priority to my tasks so that I can focus on the most important ones.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; prioritizing tasks will enhance user focus and improve task management within the app.",
      "tags": []
    },
    {
      "student_id": "346838",
      "userStory": "As a user, I want to sort my To-Dos, so that the most important for me appears on top.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the task management experience by prioritizing important To-Dos effectively.",
      "tags": []
    },
    {
      "student_id": "347041",
      "userStory": "As a user, I want to receive reminders for my to-dos so that I can meet deadlines effectively.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "347041",
      "userStory": "As a user, I want to set recurring to-dos so that tasks that repeat daily, weekly, or monthly are automatically created.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's functionality, enhancing task management for users.",
      "tags": []
    },
    {
      "student_id": "347105",
      "userStory": "As a team member user, I want to share specific to-dos with other users so that we can collaborate on tasks and complete them together.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the collaborative features of the ToDo app. Great job!",
      "tags": []
    },
    {
      "student_id": "347105",
      "userStory": "As a routine-driven user, I want to set recurring to-dos for tasks that happen regularly so that I don’t have to manually create the same task over and over again.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the app's scope, enhancing task management for routine-driven users.",
      "tags": []
    },
    {
      "student_id": "347124",
      "userStory": "As a user, I want to set reminders for my ToDos, so that I can be notified about tasks before their due dates.",
      "grade": 5,
      "feedback": "Grade 5/5. Great addition! Setting reminders enhances task management and aligns perfectly with the app's purpose of helping users stay organized.",
      "tags": []
    },
    {
      "student_id": "347124",
      "userStory": "As a user, I want to create recurring ToDos, so that I don't have to manually create new ToDos for repetitive tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app's functionality for managing repetitive tasks effectively.",
      "tags": []
    },
    {
      "student_id": "347219",
      "userStory": "As a user, I want to set reminders to my todos, so that I don't forget important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app's functionality by adding an important feature for task management.",
      "tags": []
    },
    {
      "student_id": "347446",
      "userStory": "As a user, I want to assign a priority to my to-dos so that I can quickly identify the most important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize their to-dos effectively.",
      "tags": []
    },
    {
      "student_id": "347446",
      "userStory": "As a user, I want to receive a notification when a pending task is about to be overdue so that I do not miss or forget a task.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits perfectly within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "347477",
      "userStory": "As a user, I want to receive reminders for upcoming tasks so that I don't miss important deadlines.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of managing tasks effectively.",
      "tags": []
    },
    {
      "student_id": "347492",
      "userStory": "As a user, I want to be able to filter tasks by time consumption, so that I can chose a task compatible with my available time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to select tasks based on their available time.",
      "tags": []
    },
    {
      "student_id": "347508",
      "userStory": "As a user I would like to be able to have a way to assign a priority to some tasks so that I can better know throughout the day which task should be given higher priority",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize effectively within the ToDo app.",
      "tags": []
    },
    {
      "student_id": "347572",
      "userStory": "As a user I want to be able to create a hierarchy of to dos so I can have my shopping as a to do and the shopping list inside that to do.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the task management capabilities of the ToDo app effectively.",
      "tags": []
    },
    {
      "student_id": "355522",
      "userStory": "As a user that uses the app both privately and at work, I want to create and switch between multiple profiles, so that I can sort ToDos by context.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by allowing users to manage tasks by context effectively.",
      "tags": []
    },
    {
      "student_id": "355627",
      "userStory": "As a user, I want a team tab so that I can have a To-Do list where all the members of my team can see the objectives of the project.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing collaboration within the ToDo app by allowing team visibility on project objectives.",
      "tags": []
    },
    {
      "student_id": "355664",
      "userStory": "As a user, I want to have a notification when I am close to one of my to-dos on the map, so that I can take advantage of being close to my task to do it quickly.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The story is clear, relevant, and aligns well with the app's functionality, enhancing user engagement with their tasks.",
      "tags": []
    },
    {
      "student_id": "355677",
      "userStory": "As a user, I want to be able to prioritize my task list so that I can focus on the most important one.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by allowing users to focus on important tasks.",
      "tags": []
    },
    {
      "student_id": "355687",
      "userStory": "As a user, I want to set reminders for my ToDos, so that I don't miss important deadlines.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app's functionality by addressing important task management needs.",
      "tags": []
    },
    {
      "student_id": "355687",
      "userStory": "As a user, I want to set priority levels for my ToDos, so that I can focus on the most important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize their ToDos effectively.",
      "tags": []
    },
    {
      "student_id": "355689",
      "userStory": "As a user, I want to assign a priority level to my tasks so that I can focus on completing the most important ones first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "355689",
      "userStory": "As a user, I want to set reminders for my tasks so that I receive notifications and do not forget to complete them on time.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the core functionalities of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "355731",
      "userStory": "As a user, I want to receive notifications for upcoming ToDos, so that I am reminded to complete tasks on time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's functionality, enhancing task management through timely reminders.",
      "tags": []
    },
    {
      "student_id": "355731",
      "userStory": "As a user, I want to create recurring ToDos, so that I don’t have to manually create the same task every time it repeats.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature enhances task management and is relevant to the app's purpose, providing clear value to users.",
      "tags": []
    },
    {
      "student_id": "355739",
      "userStory": "As a user, I want to pin specific ToDos to the top of my list so that I can always see my most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task visibility in the ToDo app by prioritizing important tasks effectively.",
      "tags": []
    },
    {
      "student_id": "355741",
      "userStory": "As a user, I want to be able to create a shared to-do list with my flatmates, so that we can all see what needs to be done in the apartment.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the app's scope, enhancing collaboration among users.",
      "tags": []
    },
    {
      "student_id": "355929",
      "userStory": "As a user, I want to share my to-dos, so that I can set my objectives with my team.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, aligning well with the collaborative features that enhance the ToDo app's functionality.",
      "tags": []
    },
    {
      "student_id": "355938",
      "userStory": "As a user with ADHD, I want to receive reminder notifications at a chosen frequency, so that I do not forget my tasks or feel pressured by deadlines.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, addressing a crucial feature for task management that enhances user experience.",
      "tags": []
    },
    {
      "student_id": "355965",
      "userStory": "As a user, I want to have time slots for the different to-dos I have, such that I can plan when to do those throughout my day.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to plan their day effectively.",
      "tags": []
    },
    {
      "student_id": "355965",
      "userStory": "As a user, I want to receive notifications about my to-dos, such that I can be reminded of the to-dos.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app by adding essential reminders for tasks.",
      "tags": []
    },
    {
      "student_id": "356004",
      "userStory": "As a user, I want to create a hierarchy of activities so that I can easily see which activities should be done first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by prioritizing activities effectively within the app's scope.",
      "tags": []
    },
    {
      "student_id": "356008",
      "userStory": "As a totally normal user, I want to be able to create secret tasks that can only be seen after entering a dedicated passcode so my completely acceptable daily tasks are not accessible to anyone who has access to my unlocked phone.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, effectively addressing a unique feature that enhances task privacy within the app.",
      "tags": []
    },
    {
      "student_id": "356029",
      "userStory": "As a user, I want to set reminders for my to-dos, so that I can be notified about important tasks and deadlines",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! Your user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "356029",
      "userStory": "As a user, I want to categorize my to-dos with tags and labels, so that I can easily organize and filter my tasks based on different criteria.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app, enhancing task organization.",
      "tags": []
    },
    {
      "student_id": "356106",
      "userStory": "As a user, I want to categorize my tasks so that I can organize them by type or group and filter them easily.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns well with the app's functionality for organizing tasks.",
      "tags": []
    },
    {
      "student_id": "356158",
      "userStory": "As a user, I want my to-do lists to offer personalized task suggestions based on my routine and habits so that I don't have to input every recurring task manually.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by addressing personalized task management effectively.",
      "tags": []
    },
    {
      "student_id": "356284",
      "userStory": "As a user, I want to set reminders for my to-dos so that I can receive notifications before a task is due.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the scope of the ToDo app, enhancing task management effectively.",
      "tags": []
    },
    {
      "student_id": "356302",
      "userStory": "As a user, I want to share my ToDos items with others, so that I can collaborate on tasks and keep everyone involved updated.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the scope of the ToDo app, promoting collaboration effectively.",
      "tags": []
    },
    {
      "student_id": "356302",
      "userStory": "As a user, I want to add my ToDos items to my phone's calendar based on their due dates, so that I can get reminders and manage my time more effectively.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear and relevant, enhancing task management by integrating with the calendar for reminders. Great job!",
      "tags": []
    },
    {
      "student_id": "356352",
      "userStory": "As a user, I want to access my ToDos even without an internet connection, so that I can use the app offline.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns perfectly with the app's functionality, enhancing the offline experience for users.",
      "tags": []
    },
    {
      "student_id": "356356",
      "userStory": "As a user, I want to receive notifications for upcoming to-dos, so that I can be reminded of tasks I need to complete.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app by adding a valuable reminder feature for task management.",
      "tags": []
    },
    {
      "student_id": "356356",
      "userStory": "As a user, I want to share my to-dos with other users, so that we can collaborate on tasks together.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the collaborative features that enhance the ToDo app experience.",
      "tags": []
    },
    {
      "student_id": "356365",
      "userStory": "As a user, I want to receive notifications for upcoming to-dos, so that I am reminded of tasks that are due soon.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the core functionality of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "356449",
      "userStory": "As a user, I want to be able to have shared to-do lists, so that I can plan group tasks with other users.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of managing tasks collaboratively. Great job!",
      "tags": []
    },
    {
      "student_id": "356522",
      "userStory": "As a user, I want to be able to share my ToDos with others, so that I can collaborate with them on tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing collaboration within the ToDo app's functionality. Great job!",
      "tags": []
    },
    {
      "student_id": "356653",
      "userStory": "As a user, I want to be able to organize my to-dos in categories, so that I can better manage tasks based on their type.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns well with the app's purpose of task management.",
      "tags": []
    },
    {
      "student_id": "356671",
      "userStory": "As a user, I want to be able to put priority levels on my to-dos, so that I can focus on the most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "356671",
      "userStory": "As a user, I want to set reminders on my to-dos, so that I can receive notifications before a task is due.",
      "grade": 5,
      "feedback": "Grade 5/5. Great addition! Setting reminders enhances task management and aligns perfectly with the app's purpose of helping users stay organized.",
      "tags": []
    },
    {
      "student_id": "356771",
      "userStory": "As a user, I want to organize my to-dos into custom categories, so that I can group related tasks and navigate more easily through my list.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and enhances task organization within the ToDo app.",
      "tags": []
    },
    {
      "student_id": "356844",
      "userStory": "As a user, I want to assign importance to my to-dos, so that I can prioritize what I do.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task prioritization in the ToDo app effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "357154",
      "userStory": "As a user, I want to receive notifications, so that I can get reminded of my ToDos before a deadline",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and aligns well with the app's purpose of managing tasks effectively.",
      "tags": []
    },
    {
      "student_id": "357236",
      "userStory": "As a user I want to be able to receive notifications based on the severity and importance I assigned to my ToDos, so that I do not forget any major task.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This feature enhances task management by ensuring users stay on top of important ToDos, aligning perfectly with the app's purpose.",
      "tags": []
    },
    {
      "student_id": "357241",
      "userStory": "As a user, I want to assign priority levels to my to-dos, so that I can easily focus on the most important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's purpose of managing tasks effectively.",
      "tags": []
    },
    {
      "student_id": "357241",
      "userStory": "As a user, I want to set reminders for my to-dos, so that I receive notifications when tasks are due and stay on top of my deadlines.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns perfectly with the app's purpose of helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "357403",
      "userStory": "User Story: As a user, I want to list my ToDos in order of importance, so that I can prioritize and start with the most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and aligns perfectly with the ToDo app's purpose of task prioritization.",
      "tags": []
    },
    {
      "student_id": "357825",
      "userStory": "As a frequent traveler, I want the app to notify me when I am near a location tied to a task so that I can complete tasks without having to constantly check the app.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's functionality, enhancing task completion for travelers.",
      "tags": []
    },
    {
      "student_id": "357838",
      "userStory": "As a user, I want to be able to set reminders for a specific task, so that I can complete it before its deadline.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits perfectly within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "358017",
      "userStory": "As a user, I want to assign priority levels to my ToDos, so that I can focus on the most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's functionality for task management.",
      "tags": []
    },
    {
      "student_id": "358100",
      "userStory": "As a user, I want to see my ToDos due date in my phone's calendar so that I can easily see my work for the week.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app's functionality by integrating with the phone's calendar for better task management.",
      "tags": []
    },
    {
      "student_id": "358100",
      "userStory": "As a user, I want to get notifications when I'm getting close to the due date of my ToDos, so that I don't forget to do them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns perfectly with the ToDo app's functionality, enhancing user engagement with timely reminders.",
      "tags": []
    },
    {
      "student_id": "358113",
      "userStory": "As a user, I would like to receive reminders for my tasks such that I can ensure I complete them on time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "358115",
      "userStory": "As a user, I want to receive push notifications on my device when a to-do is due within the next 24 hours, so that I can be reminded to complete it on time.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "358118",
      "userStory": "As a user, I want a focus mode that shows only tasks relevant to my current location, so I can avoid distractions from unrelated tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature enhances task relevance based on location, improving focus and usability within the app's context. Great job!",
      "tags": []
    },
    {
      "student_id": "358245",
      "userStory": "As a user, I want to be able to share to-dos with some chosen other users so that we can work together on a shared task.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the collaborative features that enhance the ToDo app experience.",
      "tags": []
    },
    {
      "student_id": "358440",
      "userStory": "As a team leader user, I want to assign my ToDos to team members so that the tasks are distributed efficiently.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management. Great job!",
      "tags": []
    },
    {
      "student_id": "358484",
      "userStory": "As an organized user, I want to prioritize my ToDos, so that I can focus on the most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, emphasizing the importance of task prioritization in the ToDo app. Great job!",
      "tags": []
    },
    {
      "student_id": "358484",
      "userStory": "As a collaborative user, I want to collaborate on ToDos with others, so that we can share tasks and work together more effectively.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's collaborative features, enhancing task sharing and teamwork.",
      "tags": []
    },
    {
      "student_id": "358495",
      "userStory": "As a user, I want to view my to-dos on a calendar, so that I can better visualize the due dates and not fall behind schedule.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the scope of the ToDo app, enhancing task visualization.",
      "tags": []
    },
    {
      "student_id": "358495",
      "userStory": "As a user, I want the to-do app to send notifications for upcoming to-do, so that I don't forget any imminent due dates.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and aligns perfectly with the app's purpose of managing tasks effectively.",
      "tags": []
    },
    {
      "student_id": "359358",
      "userStory": "As a user, I want to be notified when a To-Do deadline approaches, so that I am reminded to complete it.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the core functionality of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "359358",
      "userStory": "As a user, I want to categorize my To-Dos into different projects, so that I can organize my tasks better.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's goal of task organization. Great job!",
      "tags": []
    },
    {
      "student_id": "359392",
      "userStory": "As a user, I want to be able to switch accounts to share the application with other users without having to log out or use another device.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature enhances user experience by allowing seamless account switching, which is relevant and valuable for collaborative task management in the app.",
      "tags": []
    },
    {
      "student_id": "359393",
      "userStory": "As a user, I want to be able to highlight the most important ToDos, so that I can choose which ToDos to accomplish first.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; prioritizing ToDos will enhance user experience and task management in the app.",
      "tags": []
    },
    {
      "student_id": "359826",
      "userStory": "As a user, I want to collaborate and share my to-dos with others so that we can view and edit them together.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing collaboration features in the ToDo app effectively. Great job!",
      "tags": []
    },
    {
      "student_id": "360551",
      "userStory": "As a user who frequently travels, I want to set location-based reminders so that I am reminded to complete tasks when I arrive at specific locations.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's functionality, enhancing the task management experience for traveling users.",
      "tags": []
    },
    {
      "student_id": "360667",
      "userStory": "As a user, I want to set a task to repeat at regular intervals of my choosing, so that it continues until a specified end date.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and well within the scope of the ToDo app, enhancing task management effectively.",
      "tags": []
    },
    {
      "student_id": "360667",
      "userStory": "As an organized user, I want to categorize my ToDos by adding tags, so that I can toggle between viewing all ToDos or only those with a specific tag.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and enhances the app's functionality by allowing better organization of tasks through tagging.",
      "tags": []
    },
    {
      "student_id": "360700",
      "userStory": "As a user, I want to be able to chain ToDos (have a new to-do I wrote before appear once another one is finished) so that I can organize my day in a successive manner and not feel overwhelmed",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management and organization.",
      "tags": []
    },
    {
      "student_id": "360864",
      "userStory": "As a user, I want to receive notification from the app, so that I can be reminded of my tasks yet to fulfill.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The story is clear, relevant, and aligns well with the app's purpose of task management.",
      "tags": []
    },
    {
      "student_id": "361075",
      "userStory": "As a user, I want to be alerted when I am near the location of a task, so I can be reminded to complete it based on my current surroundings.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's functionality for task management.",
      "tags": []
    },
    {
      "student_id": "361075",
      "userStory": "As a user, I want to share my to-do items with others, so that we can work together on tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing collaboration within the ToDo app's task management features.",
      "tags": []
    },
    {
      "student_id": "361089",
      "userStory": "As a user, I want to schedule my to-dos so that I can plan my day.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear and relevant, enhancing the app's functionality by allowing users to better plan their tasks.",
      "tags": []
    },
    {
      "student_id": "361089",
      "userStory": "As a user, I want to have a reminder so that I can remember my to-dos.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app's functionality by adding a valuable reminder feature.",
      "tags": []
    },
    {
      "student_id": "361104",
      "userStory": "As a user, I want to set priority levels for my to-dos so that I can focus on completing the most important tasks first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns perfectly with the app's purpose of task management. Great job!",
      "tags": []
    },
    {
      "student_id": "361104",
      "userStory": "As a user, I want to set reminders for my to-dos so that I get notifications when a task is approaching its due date.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app by adding valuable reminder functionality for task management.",
      "tags": []
    },
    {
      "student_id": "361249",
      "userStory": "As a user, I want to receive notifications for upcoming tasks, so that I can stay on top of my to-dos.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the app's scope, enhancing task management effectively.",
      "tags": []
    },
    {
      "student_id": "361249",
      "userStory": "As a user, I want to filter my to-dos by status, so that I can easily see what I need to work on.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and aligns well with the ToDo app's functionality.",
      "tags": []
    },
    {
      "student_id": "361361",
      "userStory": "As a user, I want to be able to categorize my ToDos by priority level (e.g. low, medium and high priority), so I can manage my tasks based on their importance.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "361384",
      "userStory": "As a user, I want AI to automatically break down complex tasks into smaller, actionable steps, so that I can tackle big projects more easily.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by making task management more efficient for users.",
      "tags": []
    },
    {
      "student_id": "361396",
      "userStory": "As a user, I want to create ToDos using voice commands, so that I can add tasks quickly while I’m on the go or when my hands are occupied.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's functionality, enhancing the task creation process for users on the go.",
      "tags": []
    },
    {
      "student_id": "361396",
      "userStory": "As a user, I want to collaborate on a ToDos list with others in real-time, so that I can share and manage tasks with my team, family, or friends.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the collaborative features that enhance the ToDo app's functionality.",
      "tags": []
    },
    {
      "student_id": "361423",
      "userStory": "As a user, I want to be able to set reminders on my ToDos, so that I receive notifications to complete my tasks on time.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "361423",
      "userStory": "As a user, I want to sync my Todos with a calendar, so that I can see them alongside my scheduled events and deadlines.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear, relevant, and aligns well with the app's purpose of task management. Great job!",
      "tags": []
    },
    {
      "student_id": "361496",
      "userStory": "As a user, I want to see a timeline of my past and future ToDos so that I can visualize my productivity.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear and relevant, enhancing the app's functionality by providing a visual representation of productivity.",
      "tags": []
    },
    {
      "student_id": "361496",
      "userStory": "As a user, I want to receive notifications for upcoming due dates so that I can complete tasks on time.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "361516",
      "userStory": "As a user, I want to be able to search ToDos, so that I can find particular tasks I wrote in the past. Acceptance Criteria: - The user can search from any view a particular task and access the information of this task.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "361517",
      "userStory": "As a user, I want to be able to merge two lists of ToDos, so that I can consolidate tasks from different sources into a single list.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by allowing users to consolidate tasks effectively.",
      "tags": []
    },
    {
      "student_id": "361517",
      "userStory": "As a user, I want to share my To-Do list with another user, so that we can collaborate on tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the collaborative features that enhance the ToDo app's functionality.",
      "tags": []
    },
    {
      "student_id": "361595",
      "userStory": "As a user, I want to easily search a specific ToDo, so that I can quickly find the information I need.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app's functionality by improving task accessibility.",
      "tags": []
    },
    {
      "student_id": "361629",
      "userStory": "As a user, I want to set reminders for my to-dos, so that I can receive notifications before they are due.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the ToDo app's functionality, enhancing user experience with reminders.",
      "tags": []
    },
    {
      "student_id": "361629",
      "userStory": "As a user, I want to prioritize my to-dos, so that I can focus on the most important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management. Great job!",
      "tags": []
    },
    {
      "student_id": "361806",
      "userStory": "As a user, I want to be able to set recurrent tasks which reappear daily, weekly or monthly to my list of ToDos, so that I don't have to re-enter the same tasks every time.",
      "grade": 5,
      "feedback": "Grade 5/5. This feature enhances task management and aligns perfectly with the app's purpose, providing clear value to users.",
      "tags": []
    },
    {
      "student_id": "361831",
      "userStory": "As a user, I want to receive notifications about upcoming ToDos, so that I can ensure that I complete them on time.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "361831",
      "userStory": "As a user, I want to set priority levels for my ToDos, so that I can easily identify which ToDos are more important.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by allowing users to prioritize their ToDos effectively.",
      "tags": []
    },
    {
      "student_id": "361990",
      "userStory": "As a user, I want to categorize my ToDos using tags, so that I can filter and organize my tasks efficiently.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's goal of efficient task organization.",
      "tags": []
    },
    {
      "student_id": "362178",
      "userStory": "As a user who frequently works in groups, I want to create tasks with my group members so that we can collaboratively track what needs to be done.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The story is clear, relevant, and fits well within the app's scope for collaborative task management.",
      "tags": []
    },
    {
      "student_id": "362178",
      "userStory": "As a busy user, I want to assign priority levels to tasks so that I can better organize and focus on my most important work.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task organization. Great job!",
      "tags": []
    },
    {
      "student_id": "362180",
      "userStory": "As a user, I want to share my to-dos with other users, so that I can collaborate on tasks with my team or friends.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing collaboration within the ToDo app's scope. Great job!",
      "tags": []
    },
    {
      "student_id": "362180",
      "userStory": "As a user, I want to create a new to-do using voice commands, so that I can quickly add tasks hands-free while on the go.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's goal of enhancing task management on the go.",
      "tags": []
    },
    {
      "student_id": "362246",
      "userStory": "As a user, I want to create a to-do folder so that I can group certain related to-dos together.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task organization within the app. Great job!",
      "tags": []
    },
    {
      "student_id": "362246",
      "userStory": "As a user, I want to add programmed notifications to my to-dos so that I can remember to do something at a specific time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the scope of enhancing task management in the ToDo app.",
      "tags": []
    },
    {
      "student_id": "362262",
      "userStory": "As a user, I want to be able to duplicate a recurring task with custom intervals, so that I can efficiently manage my repetitive tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and well within the scope of the ToDo app, effectively addressing task management needs.",
      "tags": []
    },
    {
      "student_id": "362280",
      "userStory": "As a user, I want to assign different levels of priority to my ToDos, so that I can know what ToDo I should do first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's purpose of task management. Great job!",
      "tags": []
    },
    {
      "student_id": "362280",
      "userStory": "As a user, I want to assign an expiration date to my ToDos, so that I don't waste time on a ToDo that is no longer relevant.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by ensuring users prioritize their ToDos effectively.",
      "tags": []
    },
    {
      "student_id": "362341",
      "userStory": "As a user, I want to receive notifications for ToDos with upcoming deadlines so that I don't forget to complete them.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app by helping users manage deadlines effectively.",
      "tags": []
    },
    {
      "student_id": "362441",
      "userStory": "As a user, I want to know how much time each pending task will consume.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by providing time estimates for pending tasks. Great job!",
      "tags": []
    },
    {
      "student_id": "362441",
      "userStory": "As a user, I want to filter my pending tasks based on their urgency.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; filtering tasks by urgency enhances user experience and aligns perfectly with the app's functionality.",
      "tags": []
    },
    {
      "student_id": "362572",
      "userStory": "As a user, I want to create recurring tasks so that I can automatically generate new tasks for repetitive activities.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the ToDo app's functionality for managing repetitive tasks effectively.",
      "tags": []
    },
    {
      "student_id": "362885",
      "userStory": "As a user, I want to be able to tag my to-dos so that I can easily categorize and filter my to-do list.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! The user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "363054",
      "userStory": "As a user, I want to receive a reminder notification so that I don't forget my tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; reminder notifications enhance task management and align perfectly with the app's purpose.",
      "tags": []
    },
    {
      "student_id": "363054",
      "userStory": "As a user, I want to be able to add colorful tags to my tasks so that I can more easily plan my priorities.",
      "grade": 5,
      "feedback": "Grade 5/5. Great idea! Adding colorful tags will enhance task organization and prioritization, aligning perfectly with the app's purpose.",
      "tags": []
    },
    {
      "student_id": "363397",
      "userStory": "As a user, I want to be able to assign a priority to each task in order to better organize my important and less urgent tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and fits well within the scope of the ToDo app.",
      "tags": []
    },
    {
      "student_id": "363397",
      "userStory": "As a user, I want to receive notifications when a task's deadline is approaching, so that I don't forget my important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job! This user story is clear, relevant, and aligns perfectly with the app's purpose of helping users manage their tasks effectively.",
      "tags": []
    },
    {
      "student_id": "363513",
      "userStory": "As a user, I want to earn points and unlock achievements for completing tasks, so that I stay motivated and engaged with my to-do list.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear, relevant, and aligns well with the app's goal of enhancing user engagement through task completion.",
      "tags": []
    },
    {
      "student_id": "363513",
      "userStory": "As a user, I want the app to suggest to-dos based on my previous tasks and patterns, so that I can be more efficient in planning my future tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's goal of enhancing task management efficiency.",
      "tags": []
    },
    {
      "student_id": "363521",
      "userStory": "As a user, I want to set tasks to recur at regular intervals (e.g., daily, weekly, monthly), so that I can manage ongoing responsibilities easily.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and fits well within the app's scope, enhancing task management for users.",
      "tags": []
    },
    {
      "student_id": "363568",
      "userStory": "As a user, I want to be able to see my task in a scheduled form so that I can easily understand when the task should be done.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; this feature enhances task management by providing a clear schedule for users.",
      "tags": []
    },
    {
      "student_id": "363620",
      "userStory": "As a user, I want to be able to set reminders in the calendar so that I am reminded to do my ToDos.",
      "grade": 5,
      "feedback": "Grade 5/5. This story is clear and relevant, enhancing the ToDo app's functionality by adding a valuable reminder feature.",
      "tags": []
    },
    {
      "student_id": "363863",
      "userStory": "As a user, I want my to-dos to be grouped in separate priority tabs, so that I can deal with the most urgent and highest priority items first.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing task management by prioritizing items effectively within the ToDo app.",
      "tags": []
    },
    {
      "student_id": "363863",
      "userStory": "As a user, I want to receive a reminder once a day if I have unfulfilled to-do that are due within 2 days, so that I don't forget about any crucial tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. Great job clearly defining a relevant feature that enhances task management and user engagement within the ToDo app!",
      "tags": []
    },
    {
      "student_id": "363873",
      "userStory": "As a user, I want to have notifications that reminds me which tasks I need to get done.",
      "grade": 5,
      "feedback": "Grade 5/5. Great clarity and relevance; notifications enhance task management in the app, aligning perfectly with user needs.",
      "tags": []
    },
    {
      "student_id": "364142",
      "userStory": "As a user, I want to set reminders for my ToDos, so that I receive notifications when tasks are due.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns well with the app's functionality, enhancing the task management experience.",
      "tags": []
    },
    {
      "student_id": "394326",
      "userStory": "As a very busy user, I want to be able to prioritise to-dos, so that I can focus on the most important tasks first and not be distracted by less important tasks.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear and relevant, enhancing the app's functionality by allowing users to prioritize tasks effectively.",
      "tags": []
    },
    {
      "student_id": "394854",
      "userStory": "As a user, I want to receive notifications or reminders for tasks that are nearing their due dates so that I do not forget to complete them on time.",
      "grade": 5,
      "feedback": "Grade 5/5. This user story is clear, relevant, and aligns perfectly with the ToDo app's goal of helping users manage their tasks effectively.",
      "tags": []
    }
  ],
  "duplicate": [
    {
      "student_id": "324390",
      "userStory": "As a user, I want to be able to create a new task with a title and optional description so that I can keep track of things I need to accomplish. -> Acceptance Criteria:  - A user can enter a task title (required) and an optional description. - The task is added to the list of active tasks once created. - The user receives confirmation that the task has been successfully added.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story duplicates existing functionality for task creation and lacks clarity on specific actions or outcomes.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "324390",
      "userStory": "As a user, I want to be able to mark tasks as completed so that I can visually track my progress and know which tasks are done.  -> Acceptance Criteria:   - A user can click a checkbox or button next to a task to mark it as completed. - Completed tasks should be visually differentiated from incomplete tasks (e.g., strike-through, moved to a \\",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of marking tasks as completed, which is already implied in the task management functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "326477",
      "userStory": "As a new user, I want to be able to sign up using my Google account so that I can quickly create an account without filling out long forms.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of signing up, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "326477",
      "userStory": "As a current user, I want to be able to set up a password after signing up with my Google account without losing my previous account",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality, as users can already manage their accounts through Google without needing to set a password.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "327057",
      "userStory": "As a user, I want to be able to delete my to-dos so that I can remove tasks that are no longer relevant.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story duplicates an existing feature, as task deletion is already implied in managing to-dos.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "327530",
      "userStory": "As a user, I want to be able to set deadlines for my ToDos, so that I can now which are pressing and which can be delayed",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for task management and does not introduce a new feature for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "328216",
      "userStory": "As a user, I want to see my tasks.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is too vague and does not specify how you want to see your tasks, making it unclear and unactionable.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "329732",
      "userStory": "As a user, I want to set a due date on my tasks, so that I can work on urgent tasks first.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for task management and does not introduce a new feature for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "329743",
      "userStory": "As a busy user, I want to login to my account with One tap to save my time.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates the existing login feature and does not provide any new value or clarity for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "329743",
      "userStory": "As a travelling businessman, I want to know where I wrote each of my To-Do so that I can remember the context.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is vague and does not specify clear actions or outcomes related to task management in the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "339364",
      "userStory": "As a user I want to change the status of my tasks so that I can track their progress.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for task status changes and does not introduce new value to the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "339715",
      "userStory": "As a user, i want to delete my to-dos, so that i can delete task that is completed or no longer needed.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story is a duplicate of an existing feature for task deletion, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "340059",
      "userStory": "As a user, I want to mark the progress of a to do, so that I can see at a glance whether the task is in progress, finished, or haven't started yet.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features for task status tracking and does not introduce new functionality for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "340060",
      "userStory": "As a user, I want to be able to set due date for each to-do so that I can know when to finish it.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates the existing feature of setting due dates for tasks, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "342605",
      "userStory": "As a user, I want to be able to have and set deadlines for my ToDos so that I can see the time frame I have to complete them.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for setting deadlines, which is already covered in the app's features.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "342757",
      "userStory": "As a user, I want to mark my tasks as complete, so that I can track the progress of my tasks.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of marking tasks as complete, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "344314",
      "userStory": "As a user, I want to mark a to-do as done and earn fictional points, so that I stay motivated to complete my tasks.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates the existing feature of marking tasks as done and does not introduce new functionality for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "344697",
      "userStory": "As a user, I want to receive a confirmation notification after logging in with my Google account so that I can ensure the login was successful.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing login confirmation features and does not add new value to the ToDo app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "345159",
      "userStory": "As a user, I want to mark a task as completed, so that I can visually track which tasks I have finished.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story duplicates an existing feature of marking tasks as completed, which is already implied in task management.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "345159",
      "userStory": "As a user, I want to set a due date for each task, so that I can prioritize tasks based on deadlines.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of task management, as due dates are already implied in task creation.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "345556",
      "userStory": "As a user, I want to set deadlines for my to-dos, so that I can make sure I complete them in time.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story duplicates existing functionality for task management and does not introduce a new feature for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "345769",
      "userStory": "As a user, I want to mark ToDos as done, so that I can track which tasks are completed, pending, or overdue.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for marking tasks, which is already covered in the app's features.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "346571",
      "userStory": "As a user, I want to modify my ToDos, so that I can fix mistakes I made while creating them.",
      "grade": 0,
      "feedback": "Grade 0/5. This story is a duplicate, as modifying ToDos is already covered by the editing feature in the app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "346586",
      "userStory": "As a user, I want to mark a task as complete so that I know I've done it.",
      "grade": 0,
      "feedback": "Grade 0/5. This user story duplicates an existing feature of marking tasks as complete, which is already supported in the app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "347407",
      "userStory": "As a user, I want to assign locations to my to-dos and view them on a map, so that I can efficiently plan my work based on their geographical proximity.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features of task creation and mapping, failing to introduce new functionality for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "347508",
      "userStory": "As a user I would like to be able to set due date for my todo and have a notification system which would remind me when a task is about to be overdue, so that I can avoid forgetting to complete tasks.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features of task management and notifications, which are already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "355938",
      "userStory": "As a user from EPFL, I want to sign-up and login using my Tequila identifiers, so that I can work around my weekly schedule.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing login features and does not focus on task management, which is the core of the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "356284",
      "userStory": "As a user, I want to mark a to-do as \\",
      "grade": 0,
      "feedback": "Grade 0/5. This user story is incomplete and vague; please specify the action or outcome for marking a to-do.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "356352",
      "userStory": "As a user, I want to mark a ToDo as complete, so that I can keep track of which tasks are done.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of marking tasks as complete, which is already supported in the app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "356449",
      "userStory": "As a user, I want to be able to set up a due date for my tasks, so that I know which task to prioritize.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for task prioritization and does not introduce a new feature for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "356522",
      "userStory": "As a user, I want to be able to delete ToDos I have not completed but are no longer relevant to me, so that I can keep my list clean and organized.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature for task management and does not introduce new functionality for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "356653",
      "userStory": "As a user, I want to add due dates to my to-dos, so that I can keep track of every deadline and manage my time more efficiently.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features related to task management and does not introduce any new functionality for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "357772",
      "userStory": "As a user, I want edit or delete existing To-Do so that I can update or remove tasks that are no longer relevant.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features for editing and deleting tasks, which are already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "357772",
      "userStory": "As a user, I want to mark a To-do as complete, so that I can track which tasks I have already finished.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of marking tasks as complete, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "357825",
      "userStory": "As an on-the-go freelancer, I want the app to use my current location so that I can add location-based tasks and reminders relevant to where I am.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features related to location-based tasks and reminders, which are already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "357838",
      "userStory": "As a user, I want to add a deadline to a task, so that I’m aware of its priority.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for task management and does not introduce a new feature for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "358017",
      "userStory": "As a user, I want to be able to set due dates to my ToDos, so that I can keep track of when tasks need to be completed.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for task management and does not introduce a new feature for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "358113",
      "userStory": "As a user, I would like to create tasks which are linked to a specific location such that I can get reminders while passing through those places.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features of task creation and location linking, lacking new value for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "358213",
      "userStory": "As a user, I want to log in to the app using my credentials so that I can securely access my personal to-do list and manage my tasks.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature for logging in, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "358213",
      "userStory": "As an active person, I want to add new tasks with specific locations on a map so that I can visualize where each task needs to be completed and plan my route accordingly.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing features of adding tasks and viewing them on a map, lacking new value for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "361013",
      "userStory": "As a user, I want to set deadlines for my to-dos, so that I can keep track of when tasks are due and manage my time effectively.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates existing functionality for task management and does not introduce a new feature for the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "361013",
      "userStory": "As a user, I want to mark to-dos as completed, so that I can track my progress and keep my list organized.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of marking tasks as completed, which is already part of the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "361361",
      "userStory": "As a user, I want to be able to mark my ToDos as complete when I finish them, so I can track which tasks have been finished.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of marking tasks as complete in the ToDo app.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "361595",
      "userStory": "As a user, I want to set due dates for tasks, so that I can be reminded of upcoming deadlines.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of setting due dates for tasks, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "362885",
      "userStory": "As a user, I want to be able to add to-dos from my home page so that I can easily and quickly add tasks to my to-do list.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates the existing feature of adding tasks, which is already covered in the app's functionality.",
      "tags": [
        "duplicate"
      ]
    },
    {
      "student_id": "394854",
      "userStory": "As a user, I want to be able to set due dates for my tasks so that I can organize my work based on priority and deadlines.",
      "grade": 0,
      "feedback": "Grade 0/5. This story duplicates an existing feature of task management, which already includes setting due dates.",
      "tags": [
        "duplicate"
      ]
    }
  ],
  "oversized": [
    {
      "student_id": "329732",
      "userStory": "As a user, I want to tag my tasks and filter them according to the tags, so that I can choose the project on which I work.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—tagging and filtering—which makes it oversized; consider separating them for clarity and focus.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "332446",
      "userStory": "As a user, I want to be able to create, rename, and delete folders to organize my to-do lists into different categories, so that I can manage my tasks more efficiently and stay organized.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; focus on one aspect of task organization for clarity and scope.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "339394",
      "userStory": "As a user, I want to see the percentage of my tasks completed on a colorful progress diagram displayed on my screen, and be rewarded with a sparkling animation of confetti whenever I complete a task, so that I can both track my progress and feel motivated.",
      "grade": 1,
      "feedback": "Grade 1/5. The request for a colorful progress diagram and confetti animation is oversized, combining multiple features that distract from core task management functionalities.",
      "tags": [
        "oversized",
        "ui-polish"
      ]
    },
    {
      "student_id": "339511",
      "userStory": "As a busy professional, I want to create and categorize tasks in my To-Do list so that I can organize my day efficiently and prioritize my work.",
      "grade": 3,
      "feedback": "Grade 3/5. The story combines too many features at once; focus on one specific action, like creating tasks or categorizing them.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "339607",
      "userStory": "As a user, I want to be able to create group folders and classify my To-Dos, so that I can organise my tasks between different projects",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; focus on one aspect of task organization for clarity and feasibility.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "344200",
      "userStory": "As a user, I want to filter or search my ToDos, so that I can quickly find specific tasks by name, category, or date.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—filtering by name, category, and date—making it oversized; consider breaking it into smaller, focused tasks.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "345375",
      "userStory": "As a busy user, I want to be able to set a deadline for my tasks and export them in my usual calendar app so that I can visualise my deadlines.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—setting deadlines and exporting to a calendar—making it oversized; please separate them for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "345507",
      "userStory": "As a manager, I would like to be able to create groups and assign ToDos to my team to improve collaboration",
      "grade": 0,
      "feedback": "Grade 0/5. The role of a manager is not appropriate for a mobile ToDo app focused on individual task management.",
      "tags": [
        "oversized",
        "role-mismatch"
      ]
    },
    {
      "student_id": "346148",
      "userStory": "As a user, I want to be reminded for my upcoming deadlines/ToDos so that I can stay on track with my work. Acceptance criteria: 1. The user should be able to set a deadline for each ToDo. 2. The user should be able to set a reminder for each ToDo. 3. The user should receive a notification when the deadline is approaching (customizable : 1 day before/2 hours before/etc.). 4. The user should receive a notification when the reminder time is reached/passed and the task still hasn't been completed. 5. The user should be able to see the list of upcoming deadlines in the app.",
      "grade": 3,
      "feedback": "Grade 3/5. The story combines too many features at once; consider breaking it down into smaller, more focused user stories for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "346148",
      "userStory": "As a user, I want to be able to add people to each ToDo, so that I can collaborate with others on my work and make the tasks appear in their app. Acceptance criteria: 1. The user should be able to add existing users and external users (inviting them to sign-up to the app) via email to each ToDo. 2. The user should be able to see the list of people added to each ToDo. 3. The people added to a ToDo should be able to see the ToDo in their app. 4. The people added to a ToDo should be able to update its status (mark as ongoing, completed, etc.). 5. The people added to a ToDo should receive notifications for the ToDo's deadlines and reminders.",
      "grade": 3,
      "feedback": "Grade 3/5. The story combines too many features at once, making it oversized; consider breaking it down into smaller, more focused user stories.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "346838",
      "userStory": "As a user, I want to add a tag to some of my To-Dos and filtering, so that I can filter them by their tag.",
      "grade": 3,
      "feedback": "Grade 3/5. The request combines multiple features—adding tags and filtering—making it oversized; please clarify specific actions or outcomes for each feature.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "346981",
      "userStory": "As a user, I want to have a calendar with my To-Do's where bullets appear at the time of their due date, so that I know where I stand on my schedule and I can organize my time better. Acceptance criteria: - The bullets appear with their respective To-Do title, and with its To-Do associated color to differentiate same bullets in different lists). - The bullets are duplicable for other days by clicking on a button in their details page (with the choice of them being in the same To-Do or not), to handle weekly or daily chores for example. - Bullets can be postponed (button in the details page), if the user missed the due date. - A notification is sent to the user (they can disable them in settings) if a bullet's due date is in less than one day.",
      "grade": 3,
      "feedback": "Grade 3/5. The story combines too many features at once, making it oversized; consider breaking it down into smaller, more focused user stories.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "347516",
      "userStory": "As a user, I want to set a priority level for each to-do, so that I can organize my tasks based on their importance. Acceptance Criteria: 1. The user can select from priority levels (High, Medium, Low) when creating a to-do. 2. The priority is displayed next to the to-do in the list. 3. The to-do list can be filtered or sorted by priority.",
      "grade": 3,
      "feedback": "Grade 3/5. This user story combines too many features at once; consider separating the filtering and sorting functionalities for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "347516",
      "userStory": "As a user, I want to receive notifications for upcoming to-do due date, so that I can complete tasks on time. Acceptance Criteria: 1. The user can enable or disable notifications for a specific to-do. 2. A notification is triggered a set time before the due date. 3. Notifications display the title and due date of the to-do.",
      "grade": 3,
      "feedback": "Grade 3/5. This story is oversized as it combines multiple features related to notifications; consider breaking it down for clarity and focus.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "355739",
      "userStory": "As a user, I want to export my ToDos as a CSV or PDF file so that I can share or print my task lists.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features (CSV and PDF export) and is oversized; consider separating them for clarity and focus.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "356106",
      "userStory": "As a user, I want to be able to set a reminder time and have reminders for my tasks to do so that I can receive notifications about deadlines or alerts at the specified time.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—setting reminders and receiving notifications—making it oversized; please separate them for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "356158",
      "userStory": "As a user, I want to work collaboratively on to-do lists so that I can share tasks with others, assign tasks to others, and track progress on tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once, making it oversized; consider breaking it down into smaller, focused tasks.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "356523",
      "userStory": "As a blind person, I want to be able to input notes vocally and hear the inputed notes so that the app is accessible to me.",
      "grade": 2,
      "feedback": "Grade 2/5. The story combines multiple features—vocal input and audio feedback—making it oversized; please clarify specific actions or outcomes related to task management.",
      "tags": [
        "oversized",
        "typo"
      ]
    },
    {
      "student_id": "356771",
      "userStory": "User Story: As a user, I want to set deadlines for my to-dos and view them on a calendar, so that I can easily track due dates and plan my schedule accordingly.",
      "grade": 3,
      "feedback": "Grade 3/5. This user story combines too many features at once, such as deadlines and calendar views, which should be separated for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "356844",
      "userStory": "As a user, I want to share my to-dos with my friends, so that we can make tasks in common.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; please focus on a single task-related action for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "358115",
      "userStory": "As a user, I want to filter my to-dos by categories, so that I can easily view and prioritize my tasks based on closest due date, nearest location, or current status.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; consider separating the filtering by due date, location, and status into distinct user stories.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "358245",
      "userStory": "As a user, I want to start a timer on a to-do when I am working on it and stop it when I have finished so that I can track the time I spent on this task.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—starting and stopping a timer—which makes it oversized; consider separating them for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "358440",
      "userStory": "As a user, I want to assign my ToDos deadlines and reminders so that I can complete each task on time.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—deadlines and reminders—making it oversized; consider separating them for clarity and focus.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "359286",
      "userStory": "As a user, I want to share and update To-dos to my friends so that tasks can be done by many people at the same time",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; consider separating sharing and updating tasks for clarity and focus on the ToDo app's core functionalities.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "359826",
      "userStory": "As a user, I want to receive a notification when a task deadline is approaching, has passed, or for reminders, so that I avoid missing important tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—notifications for deadlines, reminders, and overdue tasks—making it oversized; please separate them for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "360551",
      "userStory": "As a user with many tasks, I want to sort and filter my ToDos based on priority, due date, or location so that I can manage my tasks more efficiently.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; consider breaking it down into separate sorting and filtering tasks for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "360700",
      "userStory": "As an admin, I want to be able to add ToDos to multiple employees at the same time so that I can be more efficient and coordinate employees",
      "grade": 0,
      "feedback": "Grade 0/5. The admin role is not appropriate for a personal ToDo app, which focuses on individual task management.",
      "tags": [
        "oversized",
        "role-mismatch"
      ]
    },
    {
      "student_id": "361516",
      "userStory": "As a user, I want to create multiple ToDos lists, so that I can classify my tasks. Acceptance Criteria: - The user can create a list and navigate between different list of ToDos.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; focus on either creating lists or navigating between them for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "362341",
      "userStory": "As a user, I want to filter my ToDos by date and priority so that I can focus on the most urgent tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—filtering by date and priority—making it oversized; consider breaking it into separate user stories for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "362572",
      "userStory": "As a user, I want to sort my tasks by due date or priority so that I can focus on what is most urgent or important.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—sorting by due date and priority—making it oversized; consider separating them for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "363088",
      "userStory": "As a user, I want to be able to assign priority levels to certain tasks and colour code them, to be able to identify more important tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines multiple features—priority levels and color coding—making it oversized; consider separating them for clarity.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "363088",
      "userStory": "As a user, I want to add prerequisites to tasks (task A must be completed before task B) and not be able to start task B while A is not yet completed.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; consider simplifying to focus on either prerequisites or task completion logic.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "363521",
      "userStory": "As a user, I want to search for and filter tasks by keywords, due dates, or categories, so that I can quickly find specific tasks.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; consider breaking it down into separate tasks for better clarity and focus.",
      "tags": [
        "oversized"
      ]
    },
    {
      "student_id": "363620",
      "userStory": "As a user, I want to separate my task in sub-parts with progress tracking so that my ToDos can better represent the tasks that I am doing and i can see how much progress I did for that task.",
      "grade": 2,
      "feedback": "Grade 2/5. The story combines too many features at once, making it unclear how progress tracking will integrate with existing task functionalities.",
      "tags": [
        "oversized",
        "typo"
      ]
    },
    {
      "student_id": "364142",
      "userStory": "As a user, I want to collaborate on ToDos with other users, so that I can assign tasks to teammates and track their progress.",
      "grade": 3,
      "feedback": "Grade 3/5. This story combines too many features at once; focus on specific actions like assigning tasks or tracking progress separately.",
      "tags": [
        "oversized"
      ]
    }
  ],
  "vague": [
    {
      "student_id": "330258",
      "userStory": "As a user, I want to create and manage custom hierarchical categories for my ToDos (e.g., \\",
      "grade": 0,
      "feedback": "Grade 0/5. The story is vague and incomplete; please clarify specific actions and outcomes related to managing ToDo categories.",
      "tags": [
        "vague",
        "typo",
        "bad-structure"
      ]
    },
    {
      "student_id": "345507",
      "userStory": "As an indecisive user, I wish I could talk to an AI through the app so that it could help me organise my \\",
      "grade": 3,
      "feedback": "Grade 3/5. The request for AI assistance is vague; please clarify specific actions or outcomes related to task management in the app.",
      "tags": [
        "vague"
      ]
    },
    {
      "student_id": "346981",
      "userStory": "As a user, I want to share my To-Do list with other people, so that I can split tasks to be done in the office with my coworkers. Acceptance criteria: - The To-Do appears as \\",
      "grade": 3,
      "feedback": "Grade 3/5. The request to share a To-Do list is vague; please specify how sharing will work and what actions users can take.",
      "tags": [
        "vague"
      ]
    },
    {
      "student_id": "347407",
      "userStory": "As a user, I want to assign priority levels (e.g., \\",
      "grade": 0,
      "feedback": "Grade 0/5. The story is vague and lacks clear actions or outcomes related to task management in the app.",
      "tags": [
        "vague",
        "typo",
        "bad-structure"
      ]
    },
    {
      "student_id": "355664",
      "userStory": "As a user, I want to have a \\",
      "grade": 3,
      "feedback": "Grade 3/5. The story is vague; please specify clearer actions or outcomes related to task management in the ToDo app.",
      "tags": [
        "vague"
      ]
    },
    {
      "student_id": "356365",
      "userStory": "As a user, I want to be able to filter my to-dos by categories such as \\",
      "grade": 3,
      "feedback": "Grade 3/5. The request for filtering by categories is vague; please specify the actions or outcomes you envision for this feature.",
      "tags": [
        "vague"
      ]
    }
  ],
  "typo": [
    {
      "student_id": "330258",
      "userStory": "As a user, I want to create and manage custom hierarchical categories for my ToDos (e.g., \\",
      "grade": 0,
      "feedback": "Grade 0/5. The story is vague and incomplete; please clarify specific actions and outcomes related to managing ToDo categories.",
      "tags": [
        "vague",
        "typo",
        "bad-structure"
      ]
    },
    {
      "student_id": "339715",
      "userStory": "As a user, i want to reminders my to-dos, so that i can be reminded before task is due.",
      "grade": 4,
      "feedback": "Grade 4/5. The typo in \"reminders\" reduces clarity; please revise for better understanding of the task-related actions.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "340946",
      "userStory": "As a user, I want to be notified when it is time for one of my task, so that I never forget any important meeting or deadline.",
      "grade": 4,
      "feedback": "Grade 4/5. The story contains a typo (\"task\" should be \"tasks\"), which reduces clarity; please revise for better understanding.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "347219",
      "userStory": "As a user, I want to search for todos by keyword, so that I can quickly find a specific tasks.",
      "grade": 4,
      "feedback": "Grade 4/5. The story contains a typo (\"specific tasks\" should be \"specific task\"), which reduces clarity.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "347407",
      "userStory": "As a user, I want to assign priority levels (e.g., \\",
      "grade": 0,
      "feedback": "Grade 0/5. The story is vague and lacks clear actions or outcomes related to task management in the app.",
      "tags": [
        "vague",
        "typo",
        "bad-structure"
      ]
    },
    {
      "student_id": "347492",
      "userStory": "As a user, I want to assign a priority level to tasks, so that I can focus on tasks with highest prority.",
      "grade": 4,
      "feedback": "Grade 4/5. The typo in \"prority\" reduces clarity; please correct it for better understanding of the feature.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "356004",
      "userStory": "As a new user, I want to add time alarm some to to-do activities so that I will no forget to do important part of the to-do list.",
      "grade": 4,
      "feedback": "Grade 4/5. The request contains typos that reduce clarity; please revise for better understanding of the desired alarm feature for tasks.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "356008",
      "userStory": "As a user, I want to be notified about potential undone tasks a few hours before the end of the day. This way I am sure to not forget task, without systematically having to open the app.",
      "grade": 4,
      "feedback": "Grade 4/5. The story contains a typo (\"task\" should be \"tasks\"), which reduces clarity in the context of task management.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "356523",
      "userStory": "As a blind person, I want to be able to input notes vocally and hear the inputed notes so that the app is accessible to me.",
      "grade": 2,
      "feedback": "Grade 2/5. The story combines multiple features—vocal input and audio feedback—making it oversized; please clarify specific actions or outcomes related to task management.",
      "tags": [
        "oversized",
        "typo"
      ]
    },
    {
      "student_id": "356574",
      "userStory": "As a busy office worker, I want to be able to receive notifications of the to Do items so that I don't have to check my phone all the time.",
      "grade": 4,
      "feedback": "Grade 4/5. The request for notifications is relevant, but please clarify specific actions or outcomes related to task management.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "358469",
      "userStory": "As a CEO, I want my ToDo's to be separable by topic so that I am not overwhelmed by the amount of task.",
      "grade": 1,
      "feedback": "Grade 1/5. The role of CEO is not appropriate for a ToDo app; please provide a relevant user role and clearer task-related actions.",
      "tags": [
        "role-mismatch",
        "typo"
      ]
    },
    {
      "student_id": "359286",
      "userStory": "As a user, I want to configure and receive reminder to specific tasks in the To-dos so that I do not forget to do a task planned for a specific date/time",
      "grade": 4,
      "feedback": "Grade 4/5. The request contains a typo (\"reminder to specific tasks\" should be \"reminders for specific tasks\"), which reduces clarity.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "359392",
      "userStory": "As a user, I want to want to be be able to log out of the app as to change account.",
      "grade": 4,
      "feedback": "Grade 4/5. The repeated \"want to\" and \"be\" reduces clarity; please revise for better readability in the context of logging out.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "359393",
      "userStory": "As a user, I want to be able to see my ToDos on a calender, so that I can manage my time better based on the ToDos due dates.",
      "grade": 4,
      "feedback": "Grade 4/5. The request to see ToDos on a calendar is outside the app’s current scope, which focuses on task management features.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "360864",
      "userStory": "As a user, I want to be able to filter my task, so that I can separate the different types of tasks.",
      "grade": 4,
      "feedback": "Grade 4/5. The typo in \"filter my task\" should be corrected to \"filter my tasks\" for clarity.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "361312",
      "userStory": "As a user, I want to be able to put a time to a To Do, so that it can remind me of a meeting or event i may miss.",
      "grade": 4,
      "feedback": "Grade 4/5. The typo in \"i\" should be corrected to \"I\" for clarity, enhancing the user story's professionalism.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "361312",
      "userStory": "As an organized user, I want to be able to classify/label my Todos, so that i can prioritize some tasks over others.",
      "grade": 4,
      "feedback": "Grade 4/5. The typo in \"i\" reduces clarity; please correct it to enhance the user story's effectiveness.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "361806",
      "userStory": "As a user, I want to have the option to export a task to my the phone's calendar app, so that I can have a time-efficient schedule.",
      "grade": 4,
      "feedback": "Grade 4/5. The phrase \"my the phone's calendar app\" contains a typo that reduces clarity; please revise for better understanding.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "363620",
      "userStory": "As a user, I want to separate my task in sub-parts with progress tracking so that my ToDos can better represent the tasks that I am doing and i can see how much progress I did for that task.",
      "grade": 2,
      "feedback": "Grade 2/5. The story combines too many features at once, making it unclear how progress tracking will integrate with existing task functionalities.",
      "tags": [
        "oversized",
        "typo"
      ]
    },
    {
      "student_id": "363873",
      "userStory": "As a user, I want to be able to create multiples toDoLists to separate the tasks per activity.",
      "grade": 4,
      "feedback": "Grade 4/5. The request to create multiple toDoLists is clear, but the typo in \"multiples\" reduces clarity. Please correct it for better understanding.",
      "tags": [
        "typo"
      ]
    },
    {
      "student_id": "394326",
      "userStory": "As a forgetful user, I want to be able to set deadlines for to-dos which remind me before before they run out, so that I can avoid forgetting tasks or finishing them too late.",
      "grade": 4,
      "feedback": "Grade 4/5. The typo in \"before before\" reduces clarity; please revise for better understanding of the deadline reminder feature.",
      "tags": [
        "typo"
      ]
    }
  ],
  "bad-structure": [
    {
      "student_id": "330258",
      "userStory": "As a user, I want to create and manage custom hierarchical categories for my ToDos (e.g., \\",
      "grade": 0,
      "feedback": "Grade 0/5. The story is vague and incomplete; please clarify specific actions and outcomes related to managing ToDo categories.",
      "tags": [
        "vague",
        "typo",
        "bad-structure"
      ]
    },
    {
      "student_id": "347407",
      "userStory": "As a user, I want to assign priority levels (e.g., \\",
      "grade": 0,
      "feedback": "Grade 0/5. The story is vague and lacks clear actions or outcomes related to task management in the app.",
      "tags": [
        "vague",
        "typo",
        "bad-structure"
      ]
    }
  ],
  "role-mismatch": [
    {
      "student_id": "341415",
      "userStory": "As a student, I want folders for to-dos so that I organize them by course or project.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"student\" is not appropriate for a ToDo app; please specify a more relevant user role.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "341415",
      "userStory": "As a student, I want notifications to remind me of the due dates of a to-dos so that I don't forget to submit my work before a deadline.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"student\" is not appropriate for the ToDo app context; please specify a more relevant user role.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "342289",
      "userStory": "As a old grandpa, I want the application to read out loud my notes so that my viewing impairment doesn't stop me from using the application.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"old grandpa\" is not appropriate for the app; consider a more relevant user persona for a ToDo app.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "345232",
      "userStory": "as a team leader , I want to share my tasks to other persons so that we can manage tasks as a team",
      "grade": 2,
      "feedback": "Grade 2/5. The role of a team leader is not appropriate for a personal ToDo app focused on individual task management.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "345507",
      "userStory": "As a manager, I would like to be able to create groups and assign ToDos to my team to improve collaboration",
      "grade": 0,
      "feedback": "Grade 0/5. The role of a manager is not appropriate for a mobile ToDo app focused on individual task management.",
      "tags": [
        "oversized",
        "role-mismatch"
      ]
    },
    {
      "student_id": "347477",
      "userStory": "As a team member, I want to share tasks with my colleagues so that we can collaborate on projects more effectively.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"team member\" is not appropriate for a personal ToDo app focused on individual task management.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "355677",
      "userStory": "As member of a team, I want to be able to assign tasks to other team members so that we can work together.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of a team member is not appropriate for a personal ToDo app; consider focusing on individual task management features.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "357154",
      "userStory": "As a team member, I want to share a ToDos list, so that we can better plan our work as a team",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"team member\" is not appropriate for this app, which focuses on individual task management rather than team collaboration.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "357236",
      "userStory": "As a business professional I want to be able to create multiple different lists of ToDos, so that I can separately keep track of my work and personal tasks.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of a business professional is not appropriate for this ToDo app, which should focus on general user needs.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "358118",
      "userStory": "As student, I want to be able to categorize tasks by subject, so I can easily find tasks related to a specific course.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"student\" is not appropriate for a general ToDo app; consider a more universal user role.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "358469",
      "userStory": "As a student, I would like to have push notifications to remind me when my deadlines are getting close.",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"student\" is not appropriate for this ToDo app, which should focus on general task management for all users.",
      "tags": [
        "role-mismatch"
      ]
    },
    {
      "student_id": "358469",
      "userStory": "As a CEO, I want my ToDo's to be separable by topic so that I am not overwhelmed by the amount of task.",
      "grade": 1,
      "feedback": "Grade 1/5. The role of CEO is not appropriate for a ToDo app; please provide a relevant user role and clearer task-related actions.",
      "tags": [
        "role-mismatch",
        "typo"
      ]
    },
    {
      "student_id": "360700",
      "userStory": "As an admin, I want to be able to add ToDos to multiple employees at the same time so that I can be more efficient and coordinate employees",
      "grade": 0,
      "feedback": "Grade 0/5. The admin role is not appropriate for a personal ToDo app, which focuses on individual task management.",
      "tags": [
        "oversized",
        "role-mismatch"
      ]
    },
    {
      "student_id": "362239",
      "userStory": "As a professional, I want to create multiple to-do lists so I can separate my work and personal life",
      "grade": 2,
      "feedback": "Grade 2/5. The role of \"professional\" is not appropriate for this app; please specify a more relevant user role.",
      "tags": [
        "role-mismatch"
      ]
    }
  ]
}